app/views/users/index.html.erb

SELECT  "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  ORDER BY "messages"."id" DESC LIMIT 1  [["conversation_id", 1]]
---
                        <h4 class="media-heading"><%= conversation_interlocutor(conversation).nickname %></h4>
                        <p><%= conversation.messages.last.nil? ? "No messages" : truncate(conversation.messages.last.body, length: 45) %></p>