app/controllers/conversations_controller.rb

  def create
    if Conversation.between(params[:sender_id],params[:recipient_id]).present?
---
SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '2' AND conversations.recipient_id ='1') OR (conversations.sender_id = '1' AND conversations.recipient_id ='2'))  ORDER BY "conversations"."id" ASC LIMIT 1

  def show
    @conversation = Conversation.find(params[:id])
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", 1]]