app/controllers/messages_controller.rb

  def create
    @conversation = Conversation.find(params[:conversation_id])
    @message = @conversation.messages.build(message_params)
    @message.user_id = current_user.id
    @message.save!
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "fghjkl"], ["conversation_id", 1], ["user_id", 2], ["created_at", "2015-04-02 03:48:38.197067"], ["updated_at", "2015-04-02 03:48:38.197067"]]