app/controllers/sessions_controller.rb

  def create
    @user = User.find_or_create_from_auth(auth)
---
INSERT INTO "users" ("provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider", "github"], ["uid", "11763537"], ["created_at", "2015-04-02 01:19:01.532456"], ["updated_at", "2015-04-02 01:19:01.532456"]]